<template>
  <div class="row">
    <router-link :to="routeEnum.chesu" class="col text-non-underline">
    <img src="../components/university/logo/chesu-logo.png" height="130"
        alt="Чеченский государственный университет им. А.А. Кадырова">
      <h6>Чеченский государственный университет имени Ахмата Абдулхамидовича Кадырова</h6>

      <p>Чеченский государственный университет является крупнейшим вузом Северного Кавказа и ведущим региональным учебным
        заведением. Он предоставляет подготовку специалистов для множества сфер деятельности в Чеченской Республике и
        других регионах.</p>

      <h6>Образование</h6>
      <p>Университет предлагает широкий спектр образовательных программ:</p>
      <ul>
        <li>Основное общее образование и среднее полное образование.</li>
        <li>Среднее профессиональное образование в 21 направлении.</li>
        <li>Бакалавриат в 39 направлениях.</li>
        <li>Магистратура в 24 направлениях.</li>
        <li>Программы ординатуры и подготовки кадров высшей квалификации.</li>
      </ul>

      <h6>Инфраструктура</h6>
      <p>Чеченский государственный университет включает в себя:</p>
      <ul>
        <li>4 института и 9 факультетов с 66 кафедрами.</li>
        <li>Подготовительное отделение для иностранных студентов.</li>
        <li>2 колледжа и лицей.</li>
        <li>Медицинский аккредитационно-симуляционный центр.</li>
        <li>Научно-исследовательские и учебные лаборатории, музей.</li>
        <li>Технопарк и спортивный клуб.</li>
      </ul>

      <h6>Научная деятельность</h6>
      <p>Университет активно занимается научной работой, решая фундаментальные и прикладные проблемы развития региона и
        страны. Здесь действуют диссертационные советы в различных областях наук.</p>

      <h6>Международное сотрудничество</h6>
      <p>Чеченский государственный университет развивает международное сотрудничество и принимает иностранных студентов из
        разных стран. Вуз имеет партнерские отношения с учебными заведениями в Германии, Великобритании, Болгарии,
        Казахстане, Турции и других странах.</p>
  </router-link>

    <router-link :to="routeEnum.gstou" class="col text-non-underline"> <img src="../components/university/logo/gstou-logo.png" height="130"
        alt="ГГНТУ им. акад. М.Д. Миллионщикова">
      <h6>История Грозненского нефтяного университета</h6>

      <p>В 1920 году в городе Грозном был организован Высший нефтяной техникум, состоящий из восьми отделений, включая два
        высших. В 1921 году Высший нефтяной техникум был переименован в Нефтяной практический институт, а в 1929 году
        произошла его реорганизация в Грозненский нефтяной институт.</p>
      <p>Постановлением Совета Народных Комиссаров СССР от 3 июля 1929 года Грозненский нефтяной институт включен в
        титульный список вузов СССР. В 1945 году институт был награжден Орденом Трудового Красного Знамени.</p>

      <p>Постановлением Совета Министров СССР от 22 июня 1973 года институту было присвоено имя академика М.Д.
        Миллионщикова.</p>

      <p>В 1999/2000 учебном году в связи с военными действиями на территории Чеченской Республики Грозненский нефтяной
        институт временно не функционировал.</p>

      <p>Однако в соответствии с решением коллегии Минобразования России от 1 февраля 2000 года и программой
        восстановления Грозненского нефтяного института, принятой приказом Министерства образования Российской Федерации
        от 25 февраля 2000 года, институт был восстановлен.</p>

      <p>Приказом Министерства образования Российской Федерации от 5 апреля 2000 года институт был переименован в
        Грозненский государственный нефтяной институт имени академика М.Д. Миллионщикова.</p>

      <p>В дальнейшем, приказом Министерства образования и науки Российской Федерации от 16 сентября 2002 года, институт
        получил статус государственного образовательного учреждения высшего профессионального образования «Грозненский
        государственный нефтяной институт имени академика М.Д. Миллионщикова».</p>

      <p>А затем, приказом Министерства образования и науки Российской Федерации от 16 мая 2011 года, институт был
        переименован в федеральное государственное бюджетное образовательное учреждение высшего профессионального
        образования «Грозненский государственный нефтяной технический университет имени академика М.Д. Миллионщикова».</p>

      <p>Позднее, приказом Министерства образования и науки Российской Федерации от 29 апреля 2015 года, университет
        получил статус федерального государственного бюджетного образовательного учреждения высшего образования
        «Грозненский государственный нефтяной технический университет имени академика М.Д. Миллионщикова».</p>
    </router-link>

    <router-link :to="routeEnum.chspu" class="col text-non-underline"> <img src="../components/university/logo/chspu-logo.png" height="130"
        alt="Чеченский государственный педагогический университет">

      <h6>История Чеченского государственного педагогического университета</h6>

      <p>Своих первых студентов институт принял в 1981 году на специальности «Физическая культура», «Русский язык и
        литература в национальной школе», «Педагогика и методика начального обучения», «Физика и математика», «Математика
        и физика», «Общетехнические дисциплины и труд». Затем в вузе стали открываться новые специальности, в частности
        «Дошкольная педагогика и психология», «Изобразительное искусство и черчение», «Химия и биология», «Биология и
        химия» и другие.</p>

      <p>Подготовка национальных кадров высшей квалификации для системы образования региона шла полным ходом, активно
        развивалась инфраструктура вуза, создавались необходимые условия для осуществления полноценного учебного процесса,
        был сформирован высококвалифицированный профессорско-преподавательский состав, введены в строй благоустроенные
        учебные корпуса и общежития. Вуз стремительно набирал популярность среди абитуриентов.</p>

      <p>Однако начавшиеся в 1991 году в Чеченской Республике разрушительные процессы и развернувшиеся затем военные
        действия не могли не отразиться на деятельности вуза. На несколько лет институт оказался изолированным от
        образовательного пространства России.</p>

      <p>После первой военной кампании, которая оставила глубокие следы в истории вуза,17 апреля 1995 г. на основании
        ходатайства Правительства национального возрождения Чеченской Республики Министерство образования Российской
        Федерации переименовало Чечено-Ингушский государственный педагогический институт в Чеченский государственный
        педагогический институт. Ректором возрожденного института стал доктор филологических наук, профессор Бекхан
        Абусупьянович Хазбулатов, который возглавлял вуз более 17 лет.</p>

      <p>Сегодня в университете разрабатываются новые подходы к работе со студентами, применяются современные методы
        обучения с использованием новейших образовательных технологий, создается эффективная система многоуровневого
        образования. Аудиторный фонд, лаборатории, мастерские, кабинеты и специальные классы оснащены всем необходимым
        оборудованием, в том числе и разнообразными техническими средствами обучения.</p>

      <p>Книжный фонд библиотеки университета насчитывает более 250 000 экземпляров, что позволяет студентам получать
        необходимую учебную, научную, методическую литературу и аудио- и видеоматериалы, а также учебные материалы на
        электронных носителях.</p>


    </router-link>
  </div>
</template>
  
<script>
import { RouteEnum } from "../enums/routeEnum";

export default {
  name: "university",
  data: function () {
    return {
      routeEnum: RouteEnum
    };
  },
  computed: {
  },

  created() {
  },
  props: {}
};
</script>
  
<style scoped>
.row {
  margin: 20px;
}

.col {
  text-align: justify;
  margin-left: 5px;
  margin-right: 5px;
  transition: 0.2s;
  border: 2px solid transparent;
  border-image: linear-gradient(90deg, #007bff, #00c853);
  border: 2px solid linear-gradient(90deg, #007bff, #00c853);
  border-image-slice: 1;
}
.col:hover {
  background-color: #b5b5b51f;
  cursor: pointer;
  transition: 0.2s;
}

.text-non-underline{
  text-decoration: none;
}
</style>
  