<template>
  <div class="chesu-conteiner">
    <div class="row">
      <h1>ФГБОУ ВО "Чеченский государственный университет им. А.А. Кадырова"</h1>
      <div class="col">
        <img src="../../components/university/img/chesu/chgu.png" alt="">
      </div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          Чеченский государственный университет имени А.А. Кадырова – один из крупнейших вузов Северного Кавказа, ведущий
          региональный вуз, являющийся основным поставщиком специалистов для большинства сфер жизнедеятельности Чеченской
          Республики, а также осуществляющий подготовку профессиональных кадров для экономики и социальной сферы других
          регионов.
        </p>
        <p class="text-info-block">
          В настоящее время в Университете подготовка ведется по образовательным программам основного общего образования,
          среднего полного образования, 21 направлению среднего профессионального образования, 31 направлению подготовки
          бакалавриата, 24 направлениям подготовки магистратуры, 9 специальностям, 13 программам ординатуры и 15
          программам
          подготовки кадров высшей квалификации в аспирантуре.
        </p>
        <p class="text-info-block">
          Дополнительное образование включает в себя такие подвиды, как дополнительное образование детей и взрослых и
          дополнительное профессиональное образование (по 16 программам повышения квалификации и 7 программам
          профессиональной переподготовки).
        </p>
        <p class="text-info-block">
          В структуру Чеченского государственного университета имени А.А. Кадырова входят 4 института и 9 факультетов (66
          кафедр), подготовительное отделение для иностранных студентов, 2 колледжа и лицей, Медицинский
          аккредитационно-симуляционный центр научно-исследовательские и учебные лаборатории, музей, технопарк, спортивный
          клуб.
        </p>
        <p class="text-info-block">
          Над решением фундаментальных и прикладных проблем развития социально-экономического и научно-технического
          потенциала республики и страны в Университете работает штат ученых и сотрудников, функционирует ряд научных
          школ,
          центр коллективного пользования и технопарк. На базе Университета также осуществляет деятельность единственная в
          Северо-Кавказском федеральном округе региональная площадка коллективной работы «Точка кипения – Грозный».
        </p>
      </div>
    </div>
    <div class="row">
      <h2>Университет в цифрах</h2>
      <div class="col">
        <img src="../../components/university/img/chesu/univers-in-digit.png" alt="" style="width: 100%;">
      </div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          Обучение в Чеченском государственном университете имени А.А. Кадырова имени А.А. Кадырова – это начало большого
          пути к перспективному трудоустройству и успешной карьере. Учебный процесс в Университете ведется на десяти
          факультетах и в четырех институтах.
        </p>
      </div>
    </div>
    <div class="row">
      <div class="text-block-conteiner">
        <div class="text-block">ПРОГРАММЫ СРЕДНЕГО ПОЛНОГО ОБРАЗОВАНИЯ</div>
        <div class="text-block">15 ПРОГРАММ ОРДИНАТУРЫ</div>
        <div class="text-block">39 НАПРАВЛЕНИЙ ПОДГОТОВКИ БАКАЛАВРИАТА</div>
        <div class="text-block">23 НАПРАВЛЕНИЯ ПОДГОТОВКИ МАГИСТРАТУРЫ</div>
      </div>
    </div>
    <div class="row">
      <div class="text-block-conteiner">
        <div class="text-block">ПРОГРАММЫ ДПО И ПК</div>
        <div class="text-block">21 НАПРАВЛЕНИЕ СРЕДНЕГО ПРОФЕССИОНАЛЬНОГО ОБРАЗОВАНИЯ</div>
        <div class="text-block">15 ПРОГРАММАМ ВЫСШЕЙ КВАЛИФИКАЦИИ</div>
      </div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          Образовательный процесс организован с применением современных технологий. Аудитории оборудованы интерактивными
          досками, аппаратурой, необходимой для проведения видеоконференций. К услугам студентов обширные ресурсы
          онлайн-библиотеки, российские и международные базы данных. Руководство университета придает большое значение
          развитию академической мобильности преподавателей и ведет активную работу по приглашению известных в
          научно-образовательной среде российских и зарубежных исследователей.
        </p>
      </div>
    </div>
    <div class="row">
      <div class="col">
        <img src="../../components/university/img/chesu/univers-in-digit2.png" alt="" style="width: 100%;">
      </div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          Университет предлагает различные направления подготовки по программам специалитета, бакалавриата, магистратуры и
          аспирантуры. </p>
      </div>
    </div>
    <div class="row">
      <h2>Международное сотрудничество</h2>
      <div class="col">
        <p class="text-info-block">
          В рамках развития международной деятельности университет принимает на полносрочное обучение по программам
          высшего образования иностранных студентов из стран ближнего и дальнего зарубежья.
        </p>
        <img src="../../components/university/img/chesu/international.png" alt="" style="width: 100%;">
      </div>


    </div>
    <div class="row">
      <div class="text-block-conteiner">
        <div class="text-block">СТУДЕНТЫ БОЛЕЕ ЧЕМ ИЗ 30 СТРАН МИРА</div>
      <div class="text-block">КОМФОРТНОЕ СТУДЕНЧЕСКОЕ ОБЩЕЖИТИЕ</div>
      </div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          В реализации программ на английском также задействованы выпускники Стипендиальной программы Главы и
          Правительства ЧР по обучению молодых кадров за рубежом, действовавшей с 2008 г. по 2013 г. На данный момент
          более 40 выпускников Программы трудоустроены в Чеченском государственном университете имени А.А. Кадырова на
          различных позициях.
        </p>
        <p class="text-info-block">
          Университет активно развивает свою партнерскую сеть, в настоящее время имея более 50 соглашений о сотрудничестве
          с различными вузами и предприятиями. Среди них как российские организации, так и зарубежные – вузы Германии,
          Великобритании, Болгарии, Казахстана, Турции и другие.
        </p>
      </div>
    </div>
    <div class="row">
      <h2>Научно-исследовательская деятельность</h2>
      <p class="text-info-block">
        В Чеченском государственном университете имени А.А. Кадырова продолжается процесс модернизации
        научно-исследовательского процесса и инновационной деятельности, направленный на развитие фундаментальных и
        прикладных исследований по приоритетным направлениям развития науки и техники Российской Федерации; модернизацию
        системы продвижения и коммерциализации результатов НИОКР и защиты прав на объекты интеллектуальной собственности.
      </p>
      <div class="col"><img src="../../components/university/img/chesu/nauka1.png" alt=""></div>
      <div class="col"><img src="../../components/university/img/chesu/nauka2.png" alt=""></div>
      <div class="col"><img src="../../components/university/img/chesu/nauka3.png" alt=""></div>
    </div>
    <div class="row">
      <div class="col"><img src="../../components/university/img/chesu/nauka4.png" alt=""></div>

      <div class="col"><img src="../../components/university/img/chesu/nauka5.png" alt=""></div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          Мероприятия, связанные с модернизацией научно-исследовательского процесса и инновационной деятельности в
          университете, сосредоточены на следующих основных направлениях: создание центров, обеспечивающих высокий уровень
          исследований в соответствии с развиваемыми в университете приоритетными направлениями развития науки, технологий
          и техники, а равно основными критическими технологиями; наращивание инновационной деятельности; создание
          эффективной системы управления научно-исследовательским процессом; интеграция образования, науки и бизнеса в
          целях коммерциализации и развития научно-технического потенциала университета; содействие в разработке,
          производстве, внедрении и выводе на международный рынок инновационных высокотехнологичных продуктов и
          технологий, созданных на основе потенциала научно-исследовательских подразделений университета.
        </p>
      </div>
    </div>
    <div class="row">
      <div class="col"><img src="../../components/university/img/chesu/nauka6.png" alt=""></div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          Создание отраслевых центров научно-технологического развития (ОЦ НТР) планируется с целью объединения усилий
          основных участников процесса развития Чеченской Республики, Российской Федерации - представителей власти,
          компаний, муниципальных образований, общественных движений, гражданских объединений, сообществ ученых и
          экспертов.
        </p>
      </div>
    </div>
    <div class="row">
      <div class="col"><img src="../../components/university/img/chesu/nauka9.png" alt="" style="width: 100%;"></div>
    </div>
    <div class="row">
      <div class="col"><img src="../../components/university/img/chesu/nauka10.png" alt="" style="width: 100%;"></div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          Тематическое содержание их деятельности определяется в соответствии с программными документами
          прогнозирования развития науки, технологий и техники, и соответствующих критических технологий в Чеченской
          Республике, Российской Федерации.
        </p>
      </div>
    </div>
    <div class="row">
      <h2>Технопарк Университета</h2>
      <div class="col"><img src="../../components/university/img/chesu/tehnopark1.png" alt="">
      </div>
      <div class="col"><img src="../../components/university/img/chesu/tehnopark2.png" alt="">
      </div>
      <div class="col"><img src="../../components/university/img/chesu/tehnopark4.png" alt="">
      </div>
    </div>
    <div class="row">
      <div class="col">
        <p class="text-info-block">
          Технопарк – структурное подразделение Чеченского государственного университета, созданный с целью поддержки
          инновационного предпринимательства путем формирования материально-технической, социально-культурной, сервисной,
          финансовой и иной базы для эффективного становления, развития, поддержки и подготовки к самостоятельной
          деятельности малых и средних инновационных предприятий, коммерческого освоения научных знаний, изобретений,
          ноу-хау и наукоемких технологий, и передачу их на рынок научно-технической продукции с целью удовлетворения
          потребности в этой продукции региона и страны.
        </p>
      </div>
    </div>
    <div class="row">
      <div class="col"><img src="../../components/university/img/chesu/tehnopark3.png" alt="">
      </div>
      <div class="col"><img src="../../components/university/img/chesu/tehnopark5.png" alt="">
      </div>
      <div class="col"><img src="../../components/university/img/chesu/tehnopark6.png" alt="">
      </div>
    </div>
  </div>
</template>
  
<script>
export default {
  name: "chesu",
  data: function () {
    return {
    };
  },
  computed: {
  },

  created() {
  },
  props: {}
};
</script>
  
<style scoped>
.chesu-conteiner {
  margin: auto;
  width: 80%;
}

.text-info-block {
  font-size: 14pt;
  text-align: justify;
  color: #112233;
}

.row {
  margin: 20px;
}

.col {
  justify-content: center;
}

h1::after {
  content: "";
  display: block;
  width: 70%;
  height: 4px;
  background: linear-gradient(90deg, #007bff, #00c853);
  /* Градиентный фон */
  margin-bottom: 10px;
  border-radius: 2px;
}

h2 {
  margin-top: 50px;
  margin-bottom: 50px;
  text-align: left;
}

h2::after {
  content: "";
  display: block;
  width: 70%;
  height: 4px;
  background: linear-gradient(90deg, #007bff, #00c853);
  /* Градиентный фон */
  margin-bottom: 10px;
  border-radius: 2px;
}

img {
  border: 5px solid transparent;
  border-image: linear-gradient(90deg, #007bff, #00c853);
  border: 5px solid linear-gradient(90deg, #007bff, #00c853);
  border-image-slice: 1;
  width: 70%;
}
.text-block-conteiner{
  display: table;
  vertical-align: middle;
  justify-content: space-between;
  border-collapse: separate;
  border-spacing: 20px;
}
.text-block {
  display: table-cell;
  padding: 5px;
  text-align: center;
  vertical-align: middle;
  border: 5px solid #007bff;
  height: 122px;
  width: 250px;
  font-weight: 700;
  font-size: 14pt;
}</style>
  